import { Item } from "../types";

export const itemsInitial: Item[] = [
  {
    label: "Наука",
    events: [
      { year: 2020, content: 'Разработка вакцин против COVID-19.' },
      { year: 2021, content: 'Запуск и успешная посадка Perseverance на Марс.' },
      { year: 2019, content: 'Достижение квантового превосходства компанией Google.' },
      { year: 2015, content: 'Обнаружение гравитационных волн от слияния черных дыр.' },
      { year: 2022, content: 'Продвижения в области искусственного интеллекта.' },
    ],
  },
  {
    label: "Образование",
    events: [
      { year: 2020, content: 'Развитие онлайн-образования в связи с пандемией COVID-19.' },
      { year: 2021, content: 'Внедрение инновационных методов обучения в образовательные процессы.' },
      { year: 2012, content: 'Новые открытия в области медицинских наук.' },
      { year: 2020, content: 'Увеличение популярности онлайн-курсов по различным предметам.' },
      { year: 2016, content: 'Международные исследовательские проекты в сфере образования.' },
    ],
  },
  {
    label: "Информация",
    events: [
      { year: 2000, content: 'Усиление цифровых платформ для распространения новостей и информации.' },
      { year: 2007, content: 'Продвижения в использовании искусственного интеллекта в обработке информации.' },
      { year: 2018, content: 'Новые технологии в обеспечении кибербезопасности.' },
      { year: 2019, content: 'Эволюция форматов интернет-журналистики.' },
      { year: 2021, content: 'Актуальные темы в мировых медийных исследованиях.' },
    ],
  },
  {
    label: "",
    events: [
      { year: 2012, content: 'Развитие цифровых технологий в искусстве и культуре.' },
      { year: 2009, content: 'Появление интерактивных выставок и искусственного интеллекта в искусстве.' },
      { year: 2021, content: 'Инновации и изменения в музыкальной индустрии.' },
      { year: 2005, content: 'Новые направления и стили в мире дизайна.' },
      { year: 2016, content: 'Создание искусства в виртуальных пространствах.' },
    ],
  },
  {
    label: "Спорт",
    events: [
      { year: 2021, content: 'Проведение летних Олимпийских игр в Токио.' },
      { year: 2022, content: 'Установка новых рекордов в различных видах спорта.' },
      { year: 2000, content: 'Значительные трансферы футбольных клубов во всем мире.' },
      { year: 2005, content: 'Инновационные методы тренировок в профессиональном спорте.' },
    ],
  },
  {
    label: "Развлечения",
    events: [
      { year: 2018, content: 'Развитие стриминговых сервисов и новые популярные шоу.' },
      { year: 2021, content: 'Переход к виртуальным форматам мероприятий и развлечений.' },
      { year: 2019, content: 'Новые тенденции и достижения в мировой киноиндустрии.' },
      { year: 2016, content: 'Увеличение популярности видеоигр и киберспортивных соревнований.' },
      { year: 2021, content: 'Взаимодействие зрителей в сфере развлечений.' },
    ],
  },
]