import { Item } from "../types";

export const itemsInitial: Item[] = [
  {
    label: "Наука",
    width: 30,
    angle: -1.5707963267948966,
    posX: null,
    posY: null,
    events: [
      {
        year: 1995,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 1996,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 1997,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 1997,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 1997,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 1997,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 2222,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
  {
    label: "Образование",
    width: 30,
    angle: -1.158855956842314,
    posX: null,
    posY: null,
    events: [
      {
        year: 1901,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2002,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 2003,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 2004,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
  {
    label: "Кино",
    width: 30,
    angle: -0.334975216937149,
    posX: 194.4418457249614,
    posY: 67.12542356071204,
    events: [
      {
        year: 1991,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 2004,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 2005,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2007,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
    ],
  },
  {
    label: "Развлечения",
    width: 30,
    angle: 0.488905522968016,
    posX: 188.28474192681682,
    posY: 146.96599134390067,
    events: [
      {
        year: 1998,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        year: 2005,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2007,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 2009,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
  {
    label: "Спорт",
    width: 30,
    angle: 1.312786262873181,
    posX: 125.51569898786613,
    posY: 196.68996382852055,
    events: [
      {
        year: 2010,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2011,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2014,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 2015,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      }
    ],
  },
  {
    label: "Космос",
    width: 30,
    angle: 2.136667002778346,
    posX: 46.38490240145492,
    posY: 184.41221066586567,
    events: [
      {
        year: 2015,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 2015,
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        year: 2017,
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        year: 2022,
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
]